tutorials/6.3.2.1D_2phase_2componenLiq_xH2O_0.5_XH2O_Solved_compositionalDarcyFoam/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp 0.orig 0 -R

runApplication blockMesh

runApplication $(getApplication)

#------------------------------------------------------------------------------